title: Azure Storage C183 - User Delegation Key Generation
id: a4a4e4b0-dbeb-4696-98f7-9f75b0d0856b
status: experimental
description: Monitor for user delegation key operations on blob storage (generation and revocation), e.g., by using an Azure custom policy on authorization.action where the value is "Microsoft.Storage/storageAccounts/blobServices/generateUserDelegationKey/action" or "Microsoft.Storage/storageAccounts/revokeUserDelegationKeys/action" in Audit mode.
testing: Perform a user delegation key operation on blob storage; it should be detected.
notes: |
    Detects a GetUserDelegationKey request unless the requester is in `%authorized_callers_c183%`.
references:
    - https://learn.microsoft.com/en-us/azure/storage/blobs/monitor-blob-storage-reference
    - https://learn.microsoft.com/en-us/rest/api/storageservices/get-user-delegation-key
    - https://learn.microsoft.com/en-us/azure/storage/blobs/storage-blob-user-delegation-sas-create-cli
author: TrustOnCloud
date: 2026-06-06
tags:
    - trustoncloud.azure.storage
    - trustoncloud.control.storage.c183
logsource:
    product: azure
    service: storagebloblogs
detection:
    selection:
        OperationName: GetUserDelegationKey
        AuthenticationType: OAuth
    filter_authorized_caller:
        RequesterObjectId|expand: '%authorized_callers_c183%'
    condition: selection and not filter_authorized_caller
falsepositives:
    - Authorized delegation-key principals not yet added to the allowlist.
level: medium
